<?php
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {


        $permissions = [
            'الواجهه الرئيسية',
            'الطلبات',
            'تفاصيل الطلبات',
            'الاتصال بنا',
            'المشرفين والاداريين',
            'مكاتب الملفات',
            'ادارة النظام',
            'تسجيل الخروج',

            'الاسلايدر',
            'مميزاتنا',
            'فوائدنا',
            'المدن',

            'كل الطلبات',
            'المهملات',

            'الطلبات الجديدة',
            'الطلبات تم الارسال',
            'الطلبات تم التسليم',
            'الطلبات تأجلت',
            'الطلبات عدم الرد',
            'الطلبات الملغية',

            'مجموعات المستخدمين',
            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'صلاحيات المستخدمين',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'صلاحيات الدخول للنظام',

            'مكتبة الملفات',
            'مكتبة الصور',

            'اعدادات عامة',
            'اعدادات لوحة التحكم',
            'الاعضاء المحظورة',

        ];



        foreach ($permissions as $permission) {

            Permission::create(['name' => $permission]);
        }


    }
}
